
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to import, 17 to add, 1 to change, 17 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
* Replace
  * module.caseworker-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.judicial-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
* Import
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod"
        name       = "rd-prod"
      ~ tags       = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-07-29T10:57:23Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.caseworker-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "rd-caseworker-topic-prod"
      + namespace_name                          = "rd-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + resource_group_name                     = "rd-prod"
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.caseworker-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ batched_operations_enabled                = false -> (known after apply)
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod/topics/rd-caseworker-topic-prod/subscriptions/rd-caseworker-subscription-prod" -> (known after apply)
        name                                      = "rd-caseworker-subscription-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod/topics/rd-caseworker-topic-prod" # forces replacement -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.judicial-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "rd-judicial-topic-prod"
      + namespace_name                          = "rd-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + resource_group_name                     = "rd-prod"
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.judicial-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ batched_operations_enabled                = false -> (known after apply)
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod/topics/rd-judicial-topic-prod/subscriptions/rd-judicial-subscription-prod" -> (known after apply)
        name                                      = "rd-judicial-subscription-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-prod/topics/rd-judicial-topic-prod" # forces replacement -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.387Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.133Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.55Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:54.513Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.313Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.19Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.377Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:06:04.963Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.2Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:06:04.29Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.32Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:05:53.113Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:06:03.553Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:06:03.803Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] must be replaced
  # (imported from "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_pim_eligible_role_assignment" "this" {
      ~ id                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod|/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a|f0a367e1-7e08-42b5-81e4-c848787e6f1e" -> (known after apply)
      + justification      = (known after apply)
        principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      ~ principal_type     = "Group" -> (known after apply)
        role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
        scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      ~ schedule {
          ~ start_date_time = "2024-03-13T15:06:04.32Z" -> "2023-11-17T11:13:01Z" # forces replacement

          ~ expiration {
              ~ duration_days  = 0 -> (known after apply)
              ~ duration_hours = 0 -> (known after apply)
                end_date_time  = "2024-11-11T11:13:01Z"
            }
        }

      ~ ticket {
          + id                 = (known after apply)
          + justification      = (known after apply)
          + principal_id       = (known after apply)
          + principal_type     = (known after apply)
          + role_definition_id = (known after apply)
          + scope              = (known after apply)
        } -> (known after apply)
    }

Plan: 15 to import, 17 to add, 1 to change, 17 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":257,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->